# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# HybriDet backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, SliceSamp, [64]]  # 0-P1/2
  - [-1, 1, SliceSamp, [128]]  # 1-P2/4
  - [-1, 3, SwinBottle, [128, True]]
  - [-1, 1, SliceSamp, [256]]  # 3-P3/8
  - [-1, 6, SwinBottle, [256, True]]
  - [-1, 1, SliceSamp, [512]]  # 5-P4/16
  - [-1, 6, SwinBottle, [512, True]]
  - [-1, 1, SliceSamp, [1024]]  # 7-P5/32
  - [-1, 3, SwinBottle, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 13



  

# HybriDet head
head:
  - [-1, 1, SliceUpsamp, [1024]]
  - [[-1, 6], 1, Concat_BiFPN, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 16
  - [-1, 3, CS_Attention, [512]]  # 17

  - [-1, 1, SliceUpsamp, [512]]
  - [[-1, 4], 1, Concat_BiFPN, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 20 (P3/8-small)
  - [-1, 3, CS_Attention, [256]]  # 21 

  - [-1, 1, SliceSamp, [256]]
  - [[-1, 13], 1, Concat_BiFPN, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  #24  (P4/16-medium)
  - [-1, 3, CS_Attention, [512]]  # 25

  - [-1, 1,SliceSamp, [512]]
  - [[-1, 9], 1, Concat_BiFPN, [1]]  # cat head P5
  - [-1, 3, C2f, [1024,True]]  # 28 (P5/32-large)
  - [-1, 3, CS_Attention, [1024]]  # 29

  - [[17, 21, 25], 1, Detect, [nc]]  # Detect(P3, P4, P5)
